2022-12-13-linux-textui-programming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Lu Hui" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="outline-container-orgdb84de6" class="outline-2">
<h2 id="orgdb84de6">linux textui programming</h2>
<div class="outline-text-2" id="text-orgdb84de6">
</div>
<div id="outline-container-org3334863" class="outline-3">
<h3 id="org3334863">setup terminal input and output</h3>
<div class="outline-text-3" id="text-org3334863">
<div class="org-src-container">
<pre class="src src-c"><code>int ttyfd = open("/dev/tty", O_RDWR);</code>
<code>struct termios termattr;</code>
<code>// get terminal attr from tty</code>
<code>tcgetattr(ttyfd, &amp;termattr);</code>
<code>// set terminal to "raw" mode</code>
<code>cfmakeraw(&amp;termattr);</code>
<code>// turn off input buffer</code>
<code>termattr.c_cc[VMIN] = 1;</code>
<code>termattr.c_cc[VTIME] = 0;</code>
<code>// apply terminal attr to tty</code>
<code>tcsetattr(ttyfd, TCSAFLUSH, &amp;termattr);</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org198d0a0" class="outline-3">
<h3 id="org198d0a0">move cursor</h3>
<div class="outline-text-3" id="text-org198d0a0">
<p>
you can use termcap to control terminal:
</p>

<div class="org-src-container">
<pre class="src src-c"><code>// from: busybox editors/vi.c</code>
<code>// VT102 ESC sequences.</code>
<code>// See "Xterm Control Sequences"</code>
<code>// http://invisible-island.net/xterm/ctlseqs/ctlseqs.html</code>
<code>#define ESC "\033"</code>
<code></code>
<code>// Cursor to given coordinate (1,1: top left)</code>
<code>#define ESC_SET_CURSOR_POS     ESC"[%u;%uH"</code>
<code></code>
<code>int textui_setcur(int ttyfd, unsigned int col, unsigned int row)</code>
<code>{</code>
<code>  char buf[32];</code>
<code>  snprintf(buf, 32, ESC_SET_CURSOR_POS, row, col);</code>
<code>  return write(ttyfd, buf, strlen(buf));</code>
<code>}</code>
</pre>
</div>

<p>
move cursor to 2, 5:
</p>

<div class="org-src-container">
<pre class="src src-c"><code>textui_setcur(ttyfd,2,5);</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org105fad9" class="outline-3">
<h3 id="org105fad9">clear screen</h3>
<div class="outline-text-3" id="text-org105fad9">
<div class="org-src-container">
<pre class="src src-c"><code>// from: busybox editors/vi.c</code>
<code>// Clear-to-end-of-screen.</code>
<code>// (We use default param here.</code>
<code>// Full sequence is "ESC [ &lt;num&gt; J",</code>
<code>// &lt;num&gt; is 0/1/2 = "erase below/above/all".)</code>
<code>#define ESC_CLEAR2EOS          ESC"[J"</code>
<code>int textui_clearterm(int ttyfd)</code>
<code>{</code>
<code>  int ret;</code>
<code>  ret = textui_setcur(ttyfd, 1, 1);</code>
<code>  if (ret &lt; 0)</code>
<code>    return ret;</code>
<code>  char buf[32];</code>
<code>  snprintf(buf, 32, ESC_CLEAR2EOS);</code>
<code>  return write(ttyfd, buf, strlen(buf));</code>
<code>}</code>
<code></code>
</pre>
</div>

<p>
make screen blank:
</p>

<div class="org-src-container">
<pre class="src src-c"><code>textui_clearterm(ttyfd);</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9ae5de7" class="outline-3">
<h3 id="org9ae5de7">draw a string</h3>
<div class="outline-text-3" id="text-org9ae5de7">
<p>
it will draw &ldquo;Hello World&rdquo; on 4, 5
</p>

<div class="org-src-container">
<pre class="src src-c"><code>char *msg = "Hello World";</code>
<code>textui_setcur(ttyfd,4,5);</code>
<code>write(ttyfd,msg,strlen(msg));</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdef3a71" class="outline-3">
<h3 id="orgdef3a71">erase a string</h3>
<div class="outline-text-3" id="text-orgdef3a71">
<p>
erase a string is also simple:
</p>

<p>
it will clean &ldquo;Hello World&rdquo; on 4, 5 (just fill space)
</p>

<div class="org-src-container">
<pre class="src src-c"><code>msg = "           ";</code>
<code>textui_setcur(ttyfd,4,5);</code>
<code>write(ttyfd,msg,strlen(msg));</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd51e86f" class="outline-3">
<h3 id="orgd51e86f">get a char from input</h3>
<div class="outline-text-3" id="text-orgd51e86f">
<p>
after setup terminal, getchar() is like getch();
</p>

<div class="org-src-container">
<pre class="src src-c"><code>int c;</code>
<code></code>
<code>while (1) {</code>
<code>  c = getchar();</code>
<code>  textui_setcur(ttyfd,4,5);    </code>
<code>  write(ttyfd,&amp;c,1);</code>
<code>  if (c == 'q')</code>
<code>    break;</code>
<code>}</code>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d6c347" class="outline-3">
<h3 id="org3d6c347">get terminal size</h3>
<div class="outline-text-3" id="text-org3d6c347">
<div class="org-src-container">
<pre class="src src-c"><code>struct winsize wsz;</code>
<code>ioctl(ttyfd, TIOCGWINSZ, &amp;wsz);</code>
<code>printf("COL: %d, ROW: %d\n", wsz.ws_col, wsz.ws_row);</code>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p>Last updated: 2023-04-18</p>
</div>
</body>
</html>